app/controllers/college_controller.rb

  def index
    sql = [" college_id = #{@member.college_id} "]
    # # search by college
    if !params[:grade].nil? && !params[:grade].blank?
      sql.push( " grade = #{params[:grade]} ")
    end
    session[:grade] = params[:grade]
    # paginate for 10 member in each page
    member = Member.find(session[:member_id])
    @students = Student.paginate(:page => params[:page], :per_page => 10, :conditions => [sql.join('and')])
---
SELECT * FROM `members` WHERE (`members`.`id` = 6)
SELECT * FROM `students` WHERE ( college_id = 3 and grade = 1980 ) LIMIT 0, 10

  def assign
    @student = Student.find(params[:id])
    @hospitals = College.find(@student.profession).hospital
---
SELECT * FROM `students` WHERE (`students`.hospital_id2 = 37)
SELECT * FROM `colleges` WHERE (`colleges`.`id` = 6)
SELECT * FROM `hospitals` INNER JOIN `colleges_hospitals` ON `hospitals`.id = `colleges_hospitals`.hospital_id WHERE (`colleges_hospitals`.college_id = 6 )

  def confirm_assign
    @student = Student.find(params[:id])
    @student.update_attributes(params[:student])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
UPDATE `students` SET `hospital_id2` = 3, `hospital_id` = 3, `updated_at` = '2013-06-23 13:08:00' WHERE `id` = 1

  def student_detials
    @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)