app/controllers/colleges_controller.rb

  def index
    @colleges = College.find_all_by_parent_id(0)
---
SELECT * FROM `colleges` WHERE (`colleges`.`parent_id` = 0) LIMIT 1

  def show
    @college = College.find(params[:id])
---
SELECT * FROM `colleges` WHERE (`colleges`.`id` = 1) LIMIT 1

  def edit
    @college = College.find(params[:id])
---
SELECT * FROM `colleges` WHERE (`colleges`.`id` = 1)

  def create
    @college = College.new(params[:college])

    respond_to do |format|
      if @college.save
---
INSERT INTO `colleges` (`parent_id`, `name`, `created_at`, `profession`, `updated_at`) VALUES(3, NULL, '2013-06-01 08:09:12', '信息管理与信息系统2', '2013-06-01 08:09:12')

  def destroy
    @college = College.find(params[:id])
    parent_id = @college.parent_id
    if parent_id == 0
      College.find_all_by_parent_id(@college.id).each do |prof|
        prof.destroy
      end
      @college.destroy
---
SELECT * FROM `colleges` WHERE (`colleges`.`id` = 1)
SELECT * FROM `colleges` WHERE (`colleges`.`parent_id` = 1)
DELETE FROM `colleges` WHERE `id` = 2