app/controllers/dean_controller.rb

SELECT * FROM `hospitals`
SELECT * FROM `students` WHERE ( hospital_id = 1 ) LIMIT 0, 10
---
  def student_list
    sql = []
    # search by college
    if !params[:college].nil? && !params[:college].blank?
      sql.push( " college_id = #{params[:college]} ")
    end
    session[:college] = params[:college]
    # search by college
    if !params[:grade].nil? && !params[:grade].blank?
      sql.push( " grade = #{params[:grade]} ")
    end
    session[:grade] = params[:grade]
    # search by hospital
    if !params[:hospital].nil? && !params[:hospital].blank?
      sql.push( " hospital_id = #{params[:hospital]} ")
    end
    session[:hospital] = params[:hospital]
    # paginate for 10 member in each page
    if !sql.empty?
      @students = Student.paginate(:page => params[:page], :per_page => 10, :conditions => [sql.join('and')])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def student_detail
  	@student = Student.find(params[:id])

SELECT * FROM `colleges` WHERE (`colleges`.`parent_id` = 0)
---
  def college_list
    @colleges = College.paginate(:page => params[:page], :per_page => 10, :conditions => ["parent_id = ?",0])

SELECT * FROM `colleges_hospitals` WHERE (`colleges_hospitals`.`college_id` = '6')
SELECT * FROM `hospitals` INNER JOIN `colleges_hospitals` ON `hospitals`.id = `colleges_hospitals`.hospital_id WHERE (`colleges_hospitals`.college_id = 6 )
SELECT * FROM `hospitals`
---
  def hospital_assign
    @collage_id = params[:id]
    @existed = []
    CollegesHospitals.find_all_by_college_id(@collage_id).each {|h|@existed.push(h.hospital_id.to_i)}
    @hospitals = Hospital.all

SELECT * FROM `colleges_hospitals` WHERE (`colleges_hospitals`.`college_id` = '4')
INSERT INTO `colleges_hospitals` (`updated_at`, `created_at`, `college_id`, `hospital_id`) VALUES('2013-06-23 04:00:50', '2013-06-23 04:00:50', 4, 1)
SELECT * FROM `colleges` WHERE (`colleges`.`id` = 5)
---
  def confirm_hospital_assin
    @hostpital = params[:hostpital]
    @college_id = params[:college_id]
    esxits = CollegesHospitals.find_all_by_college_id(@college_id)
    if @hostpital.nil?
      esxits.each do |ch|
        ch.destroy
      end
    else
      esxits_id = []
      esxits.each do |ch|
        ch.destroy if !@hostpital.include?(ch.hospital_id)
        esxits_id.push(ch.id.to_i) if @hostpital.include?(ch.hospital_id)
      end
      @hostpital.each do |hosp|
        if !esxits_id.include?(hosp)
          assin = CollegesHospitals.new
          assin.hospital_id = hosp
          assin.college_id = @college_id
          assin.save
        end
      end
      flash[:notice] == "分配成功"
    end
    redirect_to :action => :select_profession, :id=> College.find(@college_id).parent_id, :type => "hospital"

SELECT * FROM `colleges` WHERE (`colleges`.`id` = 3)
SELECT * FROM `colleges_departments` WHERE (`colleges_departments`.`college_id` = 4)
SELECT * FROM `departments`
---
  def department_assign
    @profession = College.find(params[:id])
    @existed = []
    CollegesDepartments.find_all_by_college_id(@profession).each {|h|@existed.push(h.department_id.to_i)}
    @departments = Department.all

SELECT * FROM `colleges` WHERE (`colleges`.`id` = 3)
SELECT * FROM `colleges_departments` WHERE (`colleges_departments`.`college_id` IS NULL)
INSERT INTO `colleges_departments` (`updated_at`, `department_id`, `created_at`, `college_id`) VALUES('2013-06-23 03:33:41', 1, '2013-06-23 03:33:41', 4)
---
  def confirm_department_assign
    @profession = College.find(params[:profession_id])
    @department_ids = params[:department]
    CollegesDepartments.find_all_by_college_id(@profession.id).each do |cd|
      cd.destroy
    end
    @department_ids.each do |dep|
      CollegesDepartments.create!(:college_id => @profession.id.to_i, :department_id => dep.to_i)