app/controllers/dean_controller.rb

SELECT * FROM `colleges_hospitals` WHERE (`colleges_hospitals`.`college_id` = '6')
INSERT INTO `colleges_hospitals` (`created_at`, `hospital_id`, `updated_at`, `college_id`) VALUES('2013-06-02 02:06:09', 1, '2013-06-02 02:06:09', 6)
---
  def confirm_assin
    @hostpital = params[:hostpital]
    @college_id = params[:college_id]
    esxits = CollegesHospitals.find_all_by_college_id(@college_id)
    if @hostpital.nil?
      esxits.each do |ch|
        ch.destroy
      end
    else
      esxits_id = []
      esxits.each do |ch|
        ch.destroy if !@hostpital.include?(ch.hospital_id)
        esxits_id.push(ch.id.to_i) if @hostpital.include?(ch.hospital_id)
      end
      @hostpital.each do |hosp|
        if !esxits_id.include?(hosp)
          assin = CollegesHospitals.new
          assin.hospital_id = hosp
          assin.college_id = @college_id
          assin.save