app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT * FROM `departments`

  def show
    @department = Department.find(params[:id])
---
SELECT * FROM `departments` WHERE (`departments`.`id` = 1)

  def edit
    @department = Department.find(params[:id])
---
SELECT * FROM `departments` WHERE (`departments`.`id` = 3)

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO `departments` (`updated_at`, `created_at`, `name`) VALUES('2013-06-23 02:07:48', '2013-06-23 02:07:48', '中内')