app/controllers/experiment_controller.rb

  def index
  	sql = []
    # # search by college
    if !params[:college].nil? && !params[:college].blank?
      sql.push( " college_id = #{params[:college]} ")
    end
    session[:college] = params[:college]
    # # search by college
    if !params[:grade].nil? && !params[:grade].blank?
      sql.push( " grade = #{params[:grade]} ")
    end
    session[:grade] = params[:grade]
    # paginate for 10 member in each page
    if !sql.empty?
      @students = Student.paginate(:page => params[:page], :per_page => 10, :conditions => [sql.join('and')])
---
SELECT * FROM `students` WHERE ( college_id = 3 ) LIMIT 0, 10

  def student_detials
  	@student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)

  def student_edit
  	@student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)

  def confirm_add
  	@student = Student.find(params[:id])
  	@student.update_attributes(params[:student])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
UPDATE `students` SET `updated_at` = '2013-06-01 14:09:20', `internship_grade` = '98' WHERE `id` = 1