app/controllers/grade_types_controller.rb

  def index
    @grade_types = GradeType.all
---
SELECT * FROM `grade_types`

  def show
    @grade_type = GradeType.find(params[:id])
---
SELECT * FROM `grade_types` WHERE (`grade_types`.`id` = 2)

  def create
    @grade_type = GradeType.new(params[:grade_type])

    respond_to do |format|
      if @grade_type.save
---
INSERT INTO `grade_types` (`updated_at`, `created_at`, `name`) VALUES('2013-06-22 08:04:11', '2013-06-22 08:04:11', '成绩类型1')