app/controllers/hospital_controller.rb

SELECT * FROM `students` WHERE (hospital_id = 0) LIMIT 0, 10
---
  def index
  	@students = Student.paginate(:page => params[:page], :per_page => 10, :conditions => ['hospital_id = ?',@member.hospital_id])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def student_details
  	@student = Student.find(params[:id])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def student_edit
  	@student = Student.find(params[:id])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `departments_students` WHERE (`departments_students`.`student_id` = '1')
UPDATE `students` SET `hostpital_grade` = '89', `updated_at` = '2013-06-01 16:21:40' WHERE `id` = 1
---
  def confirm_add
  	@student = Student.find(params[:id])
    total_grade = 0
    DepartmentsStudents.find_all_by_student_id(params[:id]).each do |dep|
      grade = params["dep_grade_#{dep.id}"]
      dep.update_attribute("grade", grade)
      total_grade += grade.to_i
    end
  	@student.update_attribute("hostpital_grade", total_grade)