app/controllers/hospitals_controller.rb

SELECT * FROM `hospitals`
---
  def index
    @hospitals = Hospital.all

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
---
  def show
    @hospital = Hospital.find(params[:id])

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
---
  def edit
    @hospital = Hospital.find(params[:id])

INSERT INTO `hospitals` (`grade`, `created_at`, `contact`, `address`, `tel`, `zone`, `name`, `updated_at`) VALUES('高级', '2013-06-02 02:05:57', '测试人', '济南高新区asdasd', '12345678', '济南', '测试asd医院', '2013-06-02 02:05:57')
---
  def create
    @hospital = Hospital.new(params[:hospital])

    respond_to do |format|
      if @hospital.save

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
UPDATE `hospitals` SET `boy_no` = 12, `girl_no` = 13, `updated_at` = '2013-06-23 04:17:04' WHERE `id` = 3
---
  def update
    @hospital = Hospital.find(params[:id])

    respond_to do |format|
      if @hospital.update_attributes(params[:hospital])