app/controllers/members_controller.rb

  def index
    # @members = Member.all
    # paginate for 10 member in each page
    @members = Member.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `members` LIMIT 0, 3
SELECT count(*) AS count_all FROM `members`

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)

  def edit
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)

  def create
    @member = Member.new(params[:member])
    @member.college_id = 0 if params[:member][:college_id].blank?
    @member.hospital_id = 0 if params[:member][:hospital_id].blank?
    respond_to do |format|
      if @member.save
---
INSERT INTO `members` (`college_id`, `account`, `auth`, `created_at`, `passwd`, `updated_at`, `salt`) VALUES(3, 'xueyuan1', 4, '2013-06-01 14:55:20', 'bbab71673ec7940824447bf24384e15a690a6c7a', '2013-06-01 14:55:20', NULL)

  def update
    @member = Member.find(params[:id])
    params[:member][:college_id] = 0 if params[:member][:college_id].blank?
    params[:member][:hospital_id] = 0 if params[:member][:hospital_id].blank?
    respond_to do |format|
      if @member.update_attributes(params[:member])
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)
UPDATE `members` SET `updated_at` = '2013-06-23 07:55:15', `hospital_id` = 3, `passwd` = 'c4b1c0c3ce9ce7e74f587cbbf07595899fd12184' WHERE `id` = 3

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)
DELETE FROM `members` WHERE `id` = 1