app/controllers/students_controller.rb

  def index
    sql = []
    # # search by college
    if !params[:college].nil? && !params[:college].blank?
      sql.push( " college_id = #{params[:college]} ")
    end
    session[:college] = params[:college]
    # # search by college
    if !params[:grade].nil? && !params[:grade].blank?
      sql.push( " grade = #{params[:grade]} ")
    end
    session[:grade] = params[:grade]
    # paginate for 10 member in each page
    if !sql.empty?
      @students = Student.paginate(:page => params[:page], :per_page => 10, :conditions => [sql.join('and')])
---
SELECT * FROM `students` WHERE ( college_id = 6 and grade = 2008 ) LIMIT 0, 10

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)

  def edit
    @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)

  def create
    @student = Student.new(params[:student])
    @student.birthday = "#{params[:birth_year]}-#{params[:birth_month]}-#{params[:birth_day]}"
    @student.inter_date = "#{params[:inter_year]}-#{params[:inter_month]}-#{params[:inter_day]}"
    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`home`, `email`, `stu_card_no`, `gradation`, `trust_college`, `college_id`, `sex`, `stu_class`, `college`, `class_name`, `college_year`, `degree`, `birthday`, `study_year`, `coach_tel`, `phone`, `coach`, `inter_date`, `grade`, `politics`, `incubat_direct`, `identity_no`, `profect`, `profession_no`, `hospital_id`, `stu_no`, `name`, `nation`, `proctis_action`, `created_at`, `profession`, `profession_direct`, `updated_at`, `politics_class`, `pinyin_name`) VALUES('青岛', 'swingsfcicada@gmail.com', '546345', '本科', 0, 3, '男', '好学生', NULL, '未知', '4年制', '管理学学士', '1988-7-5', '4年', '354345435', '3452345', '阿斯蒂芬', '2008', '2008', '党员', '计算机', '123534563465', '是', 3445, NULL, 20086226, '孙', '汉族', '撒旦法撒旦', '2013-06-01 07:49:28', '4', '计算机', '2013-06-01 07:49:28', '08级01班', 'sunyunrui')

  def update
    @student = Student.find(params[:id])
    params[:student][:birthday] = "#{params[:birth_year]}-#{params[:birth_month]}-#{params[:birth_day]}"
    params[:student][:inter_date] = "#{params[:inter_year]}-#{params[:inter_month]}-#{params[:inter_day]}"

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
UPDATE `students` SET `profession` = '4', `inter_date` = '2008-1-1', `college_id` = 3, `updated_at` = '2013-06-01 16:14:23' WHERE `id` = 1